<?xml version="1.0"?>
<net name="Extracted from {main_graph}" version="11">
	<layers>
		<layer id="0" name="obs" type="Parameter" version="opset1">
			<data shape="1,159" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="obs">
					<dim>1</dim>
					<dim>159</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="_wrapped_actor.actor.actor.actor_module.module.0.weight" type="Const" version="opset1">
			<data element_type="f32" shape="512, 159" offset="0" size="325632" />
			<output>
				<port id="0" precision="FP32" names="_wrapped_actor.actor.actor.actor_module.module.0.weight">
					<dim>512</dim>
					<dim>159</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="/_wrapped_actor/actor/actor_module/module/module.0/Gemm/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>159</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_11" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="325632" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="4" name="Multiply_14" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_12" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="325632" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="6" name="_wrapped_actor.actor.actor.actor_module.module.0.bias" type="Const" version="opset1">
			<data element_type="f32" shape="512" offset="325636" size="2048" />
			<output>
				<port id="0" precision="FP32" names="_wrapped_actor.actor.actor.actor_module.module.0.bias">
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Multiply_15" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32">
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="/_wrapped_actor/actor/actor_module/module/module.0/Gemm" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/_wrapped_actor/actor/actor_module/module/module.0/Gemm_output_0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="/_wrapped_actor/actor/actor_module/module/module.1/Elu" type="Elu" version="opset1">
			<data alpha="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/_wrapped_actor/actor/actor_module/module/module.1/Elu_output_0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="_wrapped_actor.actor.actor.actor_module.module.2.weight" type="Const" version="opset1">
			<data element_type="f32" shape="256, 512" offset="327684" size="524288" />
			<output>
				<port id="0" precision="FP32" names="_wrapped_actor.actor.actor.actor_module.module.2.weight">
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="/_wrapped_actor/actor/actor_module/module/module.2/Gemm/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Constant_18" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="325632" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="13" name="Multiply_21" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Constant_19" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="325632" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="15" name="_wrapped_actor.actor.actor.actor_module.module.2.bias" type="Const" version="opset1">
			<data element_type="f32" shape="256" offset="851972" size="1024" />
			<output>
				<port id="0" precision="FP32" names="_wrapped_actor.actor.actor.actor_module.module.2.bias">
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Multiply_22" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32">
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="/_wrapped_actor/actor/actor_module/module/module.2/Gemm" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/_wrapped_actor/actor/actor_module/module/module.2/Gemm_output_0">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="/_wrapped_actor/actor/actor_module/module/module.1_1/Elu" type="Elu" version="opset1">
			<data alpha="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/_wrapped_actor/actor/actor_module/module/module.1_1/Elu_output_0">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="_wrapped_actor.actor.actor.actor_module.module.4.weight" type="Const" version="opset1">
			<data element_type="f32" shape="128, 256" offset="852996" size="131072" />
			<output>
				<port id="0" precision="FP32" names="_wrapped_actor.actor.actor.actor_module.module.4.weight">
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="/_wrapped_actor/actor/actor_module/module/module.4/Gemm/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Constant_25" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="325632" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="22" name="Multiply_28" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_26" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="325632" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="24" name="_wrapped_actor.actor.actor.actor_module.module.4.bias" type="Const" version="opset1">
			<data element_type="f32" shape="128" offset="984068" size="512" />
			<output>
				<port id="0" precision="FP32" names="_wrapped_actor.actor.actor.actor_module.module.4.bias">
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Multiply_29" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32">
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="/_wrapped_actor/actor/actor_module/module/module.4/Gemm" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/_wrapped_actor/actor/actor_module/module/module.4/Gemm_output_0">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="/_wrapped_actor/actor/actor_module/module/module.1_2/Elu" type="Elu" version="opset1">
			<data alpha="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/_wrapped_actor/actor/actor_module/module/module.1_2/Elu_output_0">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="_wrapped_actor.actor.actor.actor_module.module.6.weight" type="Const" version="opset1">
			<data element_type="f32" shape="30, 128" offset="984580" size="15360" />
			<output>
				<port id="0" precision="FP32" names="_wrapped_actor.actor.actor.actor_module.module.6.weight">
					<dim>30</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="/_wrapped_actor/actor/actor_module/module/module.6/Gemm/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>30</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Constant_32" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="325632" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="31" name="Multiply_35" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Constant_33" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="325632" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="33" name="_wrapped_actor.actor.actor.actor_module.module.6.bias" type="Const" version="opset1">
			<data element_type="f32" shape="30" offset="999940" size="120" />
			<output>
				<port id="0" precision="FP32" names="_wrapped_actor.actor.actor.actor_module.module.6.bias">
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Multiply_36" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32">
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="actions" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="actions">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="actions/sink_port_0" type="Result" version="opset1" output_names="actions">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="2" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="2" to-port="1" />
		<edge from-layer="2" from-port="2" to-layer="4" to-port="0" />
		<edge from-layer="3" from-port="0" to-layer="4" to-port="1" />
		<edge from-layer="4" from-port="2" to-layer="8" to-port="0" />
		<edge from-layer="5" from-port="0" to-layer="7" to-port="0" />
		<edge from-layer="6" from-port="0" to-layer="7" to-port="1" />
		<edge from-layer="7" from-port="2" to-layer="8" to-port="1" />
		<edge from-layer="8" from-port="2" to-layer="9" to-port="0" />
		<edge from-layer="9" from-port="1" to-layer="11" to-port="0" />
		<edge from-layer="10" from-port="0" to-layer="11" to-port="1" />
		<edge from-layer="11" from-port="2" to-layer="13" to-port="0" />
		<edge from-layer="12" from-port="0" to-layer="13" to-port="1" />
		<edge from-layer="13" from-port="2" to-layer="17" to-port="0" />
		<edge from-layer="14" from-port="0" to-layer="16" to-port="0" />
		<edge from-layer="15" from-port="0" to-layer="16" to-port="1" />
		<edge from-layer="16" from-port="2" to-layer="17" to-port="1" />
		<edge from-layer="17" from-port="2" to-layer="18" to-port="0" />
		<edge from-layer="18" from-port="1" to-layer="20" to-port="0" />
		<edge from-layer="19" from-port="0" to-layer="20" to-port="1" />
		<edge from-layer="20" from-port="2" to-layer="22" to-port="0" />
		<edge from-layer="21" from-port="0" to-layer="22" to-port="1" />
		<edge from-layer="22" from-port="2" to-layer="26" to-port="0" />
		<edge from-layer="23" from-port="0" to-layer="25" to-port="0" />
		<edge from-layer="24" from-port="0" to-layer="25" to-port="1" />
		<edge from-layer="25" from-port="2" to-layer="26" to-port="1" />
		<edge from-layer="26" from-port="2" to-layer="27" to-port="0" />
		<edge from-layer="27" from-port="1" to-layer="29" to-port="0" />
		<edge from-layer="28" from-port="0" to-layer="29" to-port="1" />
		<edge from-layer="29" from-port="2" to-layer="31" to-port="0" />
		<edge from-layer="30" from-port="0" to-layer="31" to-port="1" />
		<edge from-layer="31" from-port="2" to-layer="35" to-port="0" />
		<edge from-layer="32" from-port="0" to-layer="34" to-port="0" />
		<edge from-layer="33" from-port="0" to-layer="34" to-port="1" />
		<edge from-layer="34" from-port="2" to-layer="35" to-port="1" />
		<edge from-layer="35" from-port="2" to-layer="36" to-port="0" />
	</edges>
	<rt_info />
</net>
